<?php
require("../../inc/header.php");

/*
		SoftName : EmpireBak Version 2010
		Author   : wm_chief
		Copyright: Powered by www.phome.net
*/

DoSetDbChar('utf8');
E_D("DROP TABLE IF EXISTS `sm_company`;");
E_C("CREATE TABLE `sm_company` (
  `num` int(11) NOT NULL,
  `t1` text NOT NULL,
  `j1` text NOT NULL,
  `c1` text NOT NULL,
  `t2` text NOT NULL,
  `j2` text NOT NULL,
  `c2` text NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8");
E_D("replace into `sm_company` values('1','大展鸿图，信用得固，无远弗界，可获成功','大吉','诗云：天地开泰万事成，身体康安亦富荣，否泰名誉兼享福，一生无忧乐绵长。 \r\n幸运星：★★★★★★☆\r\n顺风满帆而容易有所成就，易取富贵人生。','宇宙起源，天地开泰太极首领数。','大吉','含义：此为万事万物的基本数。为最大吉祥的表示。属于分外大成功，健康、富贵、名誉、幸福，可以享福终世。但恐有过好，常人难以承当之数。');");
E_D("replace into `sm_company` values('2','根基不固，摇摇欲坠，一盛一衰，劳而无功','凶','诗云：混吨未定如萍动，乱离不安亦波浪，独立无力多遭难，凶变病弱福寿穷。 \r\n幸运星：★★☆☆☆☆☆\r\n与人合伙比之独营好得多，若自己独营商则中途易受挫折。\r\n','混沌未定，分离破败数。','（大凶）','含义：混沌未定数。为最大凶恶暗示。无独立之气力，进退失自由，其内外生波澜，困苦不安。摇动、病患、遭难、甚至残废。如伴有其他好数者不致夭折。其人辛苦一生，志望难达，破灭无常。');");
E_D("replace into `sm_company` values('3','根深蒂固，蒸蒸日上，如意吉祥，百事顺遂','(大吉) +官','诗云：进取富贵又如意，智达明敏扬名威，名利寿福皆此得，前途光茫好鸿图。 \r\n幸运星：★★★★★★☆\r\n外缘殊胜，容易得人之助力及予人好印象。','进取如意的增进繁荣数。','（大吉）','含义：阴阳抱合，万物确定形成之象。有吉祥福禄之暗合，为成功发达之兆。智达明敏，艺精工巧，备首领之资，享自然之福。名利两全，能成大事大业。荣进有望，福祉无穷。');");
E_D("replace into `sm_company` values('4','坎坷前途，苦难折磨，非有毅力，难望成功','凶','','破败凶变的万事休止数。','（大凶）','含义：属破坏的凶变数，不足不全的灭亡之兆。进退不自由，独立乏能力。大多辛苦困难。或者与其他凶运配合而致发狂病死、夭折，或者放荡、破灭，逆难。终成废人。但孝子、节妇、怪杰等，也有出自此数者。');");
E_D("replace into `sm_company` values('5','阴阳和合，生意欣荣，名利双收，后福重重','(大吉)','诗云：福禄寿长阴阳和，心身健全是英豪，名利双收富荣达，乃是世上福德人。\r\n幸运星：★★★★★★☆\r\n财源特佳金钱有餘，离出生之地而往大都市求谋必得更发达。','福禄长寿的福德集门数。','（大吉）','含义：阴阳交感，和合、完壁之象。暗藏大成功运。精神敏达，身体健全，福禄长寿，富贵繁荣，无所不至。或为中兴之祖，或在他乡成家，或复兴绝家。即使不如此，也会博得功名荣誉，福德兼备，圆通无碍，福祉祯祥。');");
E_D("replace into `sm_company` values('6','万宝云集，天降幸运，立志奋发，可成大功','(中吉)','诗云：安稳余庆福禄开，盛大幸福天赐来，内含衰兆应谨慎，注意品行福乐享。 \r\n幸运星：★★★★★☆☆\r\n名誉良好，信用亦佳，步步高升。','安稳余庆吉人天相数。','（大吉）','含义：天德地祥俱备，福庆甚丰，家势盛大，万宝朝宗之运。然而满极则损，盈极则亏。若其他要素配合不周者，恐或如流水而下，成为所谓乐极生悲之象。此数理俱为天赋之美，安稳吉庆终世。');");
E_D("replace into `sm_company` values('7','专心经营，和气致祥，排除万难，必获成功','(中吉)','诗云：刚毅果断除万难，独立权威志气安，内外和好兼柔性，温和养德耀吉星。 \r\n幸运星：★★★★★☆☆\r\n很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。','刚毅果断勇往直前的进取数。','（吉）','含义：独立、单行、极感之象，过刚而缺乏同化力之意。如果顽刚弄权柄，易酿成内外不和。幸而天赋的精力充沛，具有调理事物的才能。能够粉碎硬敌，排除万难。若能涵养雅量，扩大气度，自然幸福上进。女性在此数者，难免有男性的惰性。切要注意温和养德，才会吉利而无过失。');");
E_D("replace into `sm_company` values('8','努力发达，贯彻志望，不忘进退，成功可期','(中吉)','诗云：意志坚刚善恶明，富进取心求和平，忍耐克己如心意，前难后成可安然。 \r\n幸运星：★★★★★☆☆\r\n很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。','意志刚健的勤勉发展数。','（吉）','含义：意志如铁石，富于进取的气概。排除万难达到目的而名实两得。忍耐克己，逐成大功。但其他运配合不善者，可能有遭难的厄患。');");
E_D("replace into `sm_company` values('9','虽抱奇才，有才无命，独营无力，财利无望','凶','','兴尽凶始，穷乏困苦数','（凶）','含义：利去功空，陷落穷迫，屹、逆运、短命、怪澹、悲痛，或者幼少离亲而困苦。或者病弱、不遇、遭难、废疾、贫困、灾难、孤独，甚至弄罚。有不测的凶厄。主运有此数者则为大凶。即或一身得免灾害，也难免配偶丧失或有缺子之叹。实为人生最恶运。但有例外的怪杰、富豪能出此数者。');");
E_D("replace into `sm_company` values('10','乌云遮月，暗淡无光，空费心力，徒劳无功','凶','','万事终局充满损耗数。','（凶）','含义：其凶恶更甚于九数，为事物吉终之运。有如黑暗的境地，空虚无物，主运有此数者，多非业短命。如同日没，四顾茫茫，神哭鬼号振凶之象。行万事乏气力，常陷于不如意，凡要收功，便遇障碍，渐自失败。遂致破家亡户。或者贫困逆难迭至，无眷属之缘。或者自幼失亲、或者病弱、遭难。或者有不则之灾祸，或犯官府等，难免非业非运。三才配合不善者，大都中年前后编入黄泉之籍。然万人中亦有一二例外。例外者可绝处逢生。');");
E_D("replace into `sm_company` values('11','草木逢春，枯叶沾露，稳健着实，必得人望','(大吉)','诗云：挽回家运矣春光，顺调发展财辉煌，温和笃实阴阳合，稳健顺调得人望。 \r\n幸运星：★★★★★★☆\r\n顺风满帆而容易有所成就，易取富贵人生。外缘殊胜，容易得人之助力及予人好印象。','稳健吉顺富贵荣达数。','（大吉）','含义：阴阳复新，享天赋的幸福。万事顺序发达，稳健着实。次得富贵繁荣，有再兴家的暗示。能挽回家运平静和顺的最大吉数。');");
E_D("replace into `sm_company` values('12','薄弱无力，孤立无摇，外祥内苦，谋事难成','凶','','意志薄弱的家庭寂寞数。','（凶）','含义：有无理伸张之象。不顾薄弱无力，企图做无力做的事，反致失败。遇事易生不足之心。家庭缘薄，孤独，遭难，逆境，病弱，不如意，困难等。又可因其他运的配合而导致意外的失败，甚至有不能完寿的悲运。');");
E_D("replace into `sm_company` values('13','天赋吉运，能得人望，善用智慧，必获成功','(大吉) +官+艺','诗云：智略超群博学多，善处事务亦忍和，功业成就得富荣，艺才相身乐千锺。 \r\n幸运星：★★★★★★☆\r\n外缘殊胜，容易得人之助力及予人好印象。具有此数之人，男多勇敢果断，女多貌若天仙，有风流不羁(不顾时局大体)倾向，若修养不够或抑制力不强，往往因桃色事件惹来麻烦。','智略超群的博学多才数。','（大吉）','含义：富学艺才能，有智谋奇略。忍柔当事；任何难，皆巧于措置以奏大功。为得享富贵幸福的好诱导。充满智慧是其特点。');");
E_D("replace into `sm_company` values('14','忍得苦难，必有后福，是成是败，惟靠坚毅','凶','','沦落天涯失意烦闷数。','（凶）','含义：多破兆，家属缘薄。丧亲、亡子、兄弟姊妹分离。孤独、不如意、烦闷、危难、遭厄、浮沉不定，为人慷慨、施恩招怨。劳而无功、辛惨孤独，其他运数配合不宜者，有伤天寿。');");
E_D("replace into `sm_company` values('15','谦恭做事，必得人和，大事成就，一定兴隆','(大吉)+财','诗云：福寿拱照德望高，财子寿全又温和，慈祥好善可恭敬，富贵繁荣得惠泽。 \r\n幸运星：★★★★★★☆\r\n财源特佳金钱有餘，离出生之地而往大都市求谋必得更发达。外缘殊胜，容易得人之助力及予人好印象。','福寿双全的立身兴家数。','（大吉）','含义：此数为最大好运，福寿圆满之象。顺和、温良、雅量。多受福泽，德高望重，自成大业，富贵荣华，吉祥有德，繁荣兴家的大吉数。');");
E_D("replace into `sm_company` values('16','能获众望，成就大业，名利双收，盟主四方','(大吉)+财+官','诗云：贵人得助天乙扶，为人之上有财富，众望所归事业成，不可贪色保安宁。 \r\n幸运星：★★★★★★☆\r\n名誉良好，信用亦佳，步步高升。外缘殊胜，容易得人之助力及予人好印象。','贵人相助兴家兴业的大吉数。','（大吉）','含义：反凶化吉象。成首领，占上峰，雅量厚重，豪侠足智多谋，善于协调，集名望。能服众。为大事大业可成，富贵发达的好暗示。');");
E_D("replace into `sm_company` values('17','排除万难，有贵人助，把握时机，可得成功','(中吉)','诗云：突破万难权威高，刚性固执如英豪，须事谨慎守和平，可得大功奏业成。 \r\n幸运星：★★★★★☆☆\r\n很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。','突破万难的刚柔兼备数。','（大吉）','含义：权威刚强，有己无人，以至与人不和。如善于矫正此短处，则为大吉。意志坚定，具突破诸难的气力是其最大的优点。如果过于无理任性，恐反成失败。如果立志勇往直前，必成功而建大业。若陷入过分刚烈则变成大执，必招厄患，切要警戒。妇女有此数者易流于男性，如果能涵养女德，存主温和，福禄自然随之。但先天条件弱的妇女，反用此数为妥。');");
E_D("replace into `sm_company` values('18','经商做事，顺利昌隆，如能慎始，百事亨通','(中吉)+艺','诗云：有志竟成事皆通，智谋发展有威望，过刚遭难咸柔德，博得名利大成功。 \r\n幸运星：★★★★★☆☆\r\n很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。','有志竟成了内外有运数。','（大吉）','含义：铁石心发达运具备，有权力智谋。志现一方，必破诸难，博得名利。但是自信心强，乏包涵力。要戒坚刚过顽，诱发非难。宜养柔德，且慎勿骄，则目的贯彻，功成名就。');");
E_D("replace into `sm_company` values('19','成功虽早，慎防空亏，内外不合，障碍重重','凶','','反应机敏，先声夺人数。','（中吉）','含义：有多智谋、善活动的素质。虽有兴大业，博得名利的实力，但易发生意外的陷害，内外不和，困难苦惨不绝。如果主运有此数，又乏其他吉数以助，多陷病弱、废疾、孤寡甚至夭折，妻子死别、刑罚、杀伤等灾。为万事挫折非命至极。故也叫短命数。便先天有金水者，可成巨富，怪杰，伟人。');");
E_D("replace into `sm_company` values('20','智高志大，历尽艰难，焦心忧劳，进退两难','凶','','实而不华，深藏不露数。','（中吉）','含义：物将坏之象。具有短命非业的诱导。所谓大凶之运一生不得平安，灾难迭至，凶祸濒临，不如意，陷于逆境。或导致病弱、短命，非业，破灭，不能支持一家者。或幼时别亲。而陷困苦，或叹女子不幸，或者男女丧失其配偶。为万事不成。终世进退维谷。');");
E_D("replace into `sm_company` values('21','专心经营，善用智慧，霜雪梅花，春来怒放','(大吉) +官','诗云：明月光照乐依依，俟如梅花待放时，兴家立业名利全，各自独立有权威。 \r\n幸运星：★★★★★★☆\r\n男带此数，需要加强节制力，可免受桃花困扰。女则因事业雄心万丈，多晚婚。','明月光照，独立权威数。','（大吉）','含义：光风霁月之象，万物形成自立之势。独立权威，能为首领之运。为人尊仰享受富贵显荣。路径属迈进发展，中途难免相当苦心步步而进，宛登梯一样。立业兴家，大博名利，乃贵重的吉数。因系伟大的首领格妇女得此数者，以招灾害。按《易经》观点女性属阴应助男性，是为先天的补数，如具备首领之运，即妻凌夫之格。阴阳生出暗斗，自然不得安宁，故夫妻难免时常反目，或喜极生悲，且女德不备，家庭不圆满，妻便克夫，所谓两虎相斗，必无双全者慎之戒之。');");
E_D("replace into `sm_company` values('22','秋草逢霜，怀才不遇，忧愁怨苦，事不如意','凶','','秋草逢霜的两士相争数。','（半吉半凶）','含义：百事不如意，志向半途挫折，多属懦弱，正如秋草逢霜象。困难、病弱、乏气力，陷孤独、逆境不平等，但也有伟人、豪杰出此数者，不过其人生多波折。');");
E_D("replace into `sm_company` values('23','旭日升天，名显四方，渐次进展，终成大业','(大吉) +官','诗云：旭日东昇势壮富，贯彻大业万事胜，终至荣达功名显，猛虎添翼势声强。 \r\n幸运星：★★★★★★☆\r\n具有此数之人，男多勇敢果断，女多貌若天仙，有风流不羁(不顾时局大体)倾向，若修养不够或抑制力不强，往往因桃色事件惹来麻烦。\r\n','旭日东升的质实刚坚数。','（大吉）','含义：伟人昌隆之运，威势冲天象。微贱出身，逐渐长大，终到首领。有如凯旋之将，猛虎添翼之状。权势旺盛，制胜事物，功名荣达，大志大业可成，但平常气血强旺，临事恐过度而为憾。然而感情锐利，壮丽可爱，实属贵重的运数。但妇女有此数则不可，其理由同于二十一数，妇女凡主运以及他格有此数者，难免香闰零落而秀榻悲寒也。');");
E_D("replace into `sm_company` values('24','锦绣前程，须靠自力，多用智谋，能奏大功','(大吉)+财','诗云：家门余庆福无疆，子孙繁荣富贵强，白手成家立大业，财源广进智谋全。 \r\n幸运星：★★★★★★☆\r\n营商的话还是独营的好，与人合伙久之厌烦不耐。少年读书需用心，舟至桥头直自然。','家门余庆的金钱丰盈数。','（大吉）','含义：路途多有崎岖，实为难免。然而才略智谋出众，白手可成家，财源广进，到老愈丰，子孙继承余庆的福运。');");
E_D("replace into `sm_company` values('25','天时地利，再得人格，讲信修睦，即可成功','(中吉)','诗云：资性英敏有奇能，怪癖不和害前程，修身涵养与仁和，奏功获得大鸿图。 \r\n幸运星：★★★★★☆☆\r\n需要注重个人私生活，可免因桃色韵事贻误前程。','英俊刚毅资性聪敏数。','（大吉）','含义：资性英敏，有奇特的才能。唯性情不平衡也偏重于一方，言语多少有些棱角，柔中带硬，或者有怪脾气。故涵养不足者，多成怪人。与外人打交道缺谦虚，以英俊文才，自能完成大业。倘任意气用事，傲慢无礼，恐弄吉反凶。');");
E_D("replace into `sm_company` values('26','波澜起伏，千变万化，凌驾万难，必可成功','凶','','变怪奇异的豪侠数。','（半吉半凶）','含义：属波澜重叠，数奇变怪的英雄运格。赋性颖悟，富有义气侠情。然而变动常多。风波不息。此数中人临万难，越死线，而奏大功者有之。又可因为他格的配合，或陷安逸、淫乱、短命，或者丧配偶，衾祷生霜。或丧子妇，膝下零丁。大都属不得顺境的凶运。但不少怪杰、烈士、伟人则有出其格者。');");
E_D("replace into `sm_company` values('27','一成一败，一盛一衰，惟靠谨慎，可守成功','凶带吉','','足智多谋，先苦后甜数。','（半凶半吉）','含义：自信心过强，多受诽谤，而易致失败所谓诽难运。大多为半途中折之象。始以共智谋，奋力努力，博得名利。待过中年，势渐趋下，内外酿出不和，难以发达到老，假命使自身温顺富有，也不免内部背后是非不息。也可因其他运的关系，或陷刑罚、孤独、变死逆难等。');");
E_D("replace into `sm_company` values('28','鱼临旱地，难逃恶运，此数大凶，不如更名','凶','','家亲缘薄，离群独处无定数。','（凶）','含义：堪称遭难运。有一种豪杰气概，多于波澜变发，难免非难诽谤。时或厄运袭来，而致伤害。或丧失配偶，或克子孙，也可能有自幼别亲者，总之大都有祸乱，争论不和、逆难、刑罚等，灾祸相接，终世劳苦。妇女有此数者多陷于孤寡或难成家的运格。');");
E_D("replace into `sm_company` values('29','如龙得云，青云直上，智谋奋进，才略奏功','(大吉)）+财+官+艺','诗云：欲望难足希望高，计谋成功财力豪，猜疑嫉妒性自改，如龙乘云势运开。 \r\n幸运星：★★★★★★☆\r\n智能超人贯彻大志，富贵无比，不甘寂寞，叱吒风云之大吉数，但容易发生牢骚及贪心、欲望太多而永不知足，为其缺点。切忌沉迷投机，可免贻误前程。','知谋兼备，欲望难足数。','（半凶半吉）','含义：知谋优秀，秦功受福之咱。财力活动力具备，成就大业之兆。但是不足不平的念头不绝。任意从事欲望无止境，多易弄巧成拙。至于妇女，都流于男性，或者酿出荒唐猜疑之灾，切要慎戒之。');");
E_D("replace into `sm_company` values('30','吉凶参半，得失相伴，投机取巧，如赛一样','凶','','一成一败，绝处逢生数。','（半凶半吉）','含义：浮沉不定，凶吉难分。即因其他运的配合，或者成大功，或者沉于失败。故乘吉运者，成功自至。数理不良者，不知不觉之间陷于失败。其遭遇不可测，突然别开生面者有之。就像开矿探险一样，大成大败。都有些侥幸。另外也有孤独、丧失妻子、短命者。');");
E_D("replace into `sm_company` values('31','此数大吉，名利双收，渐进向上，大业成就','(大吉)+官','诗云：智勇得志意气新，建立声誉事业兴，终到富贵福禄奏，为人领导德望高。 \r\n幸运星：★★★★★★☆\r\n顺风满帆而容易有所成就，易取富贵人生。','智勇得志，心想事成数。','（大吉）','含义：智仁俱备，意志坚固，千挫不挠，脚步踏实，可成大志，能成就大业的运格，可统率众人，博得名誉，繁荣富贵，幸福。属温良平静、威力强大的首领运。');");
E_D("replace into `sm_company` values('32','池中之龙，风云际会，一跃上天，成功可望','(中吉)+财','诗云：侥倖所得贵人扶，善捉机会有财富，认真努力向前程，家门隆昌得富荣。 \r\n幸运星：★★★★★☆☆\r\n与人合伙比之独营好得多，若自己独营商则中途易受挫折。','权贵显达的意外惠泽数。','（大吉）','含义：侥幸多望之格。若能长辈提携，其成功势如破竹。且品性温良。大有爱护他人德，家门隆昌，繁荣。至上的吉数。');");
E_D("replace into `sm_company` values('33','不可意气，善用智慧，如能慎始，必可昌隆','(大吉)+财+艺','诗云：家门隆昌精神爽，博得名利星月朗，权威智谋极周全，君是天下富贵翁。 \r\n幸运星：★★★★★★☆\r\n具有此数之人，男则勇敢果断，而女则美貌如仙子，有风流不羁(不顾时局大体)倾向，若修养不够或抑制力不强，往往因桃色事件惹来麻烦。','家门隆昌的才德开展数。','（大吉）','含义：鸾凤相会之象，形成确定之意。多功威智谋，刚毅果断。有如旭日东升，旺盛隆昌至极，属名闻天下的吉祥运。但如果过刚毅，反致误事。而且过贵重，常人恐不堪受。便是物极必反，尊荣的反面为黑暗，勿轻用之。妇女断不可用，用则孤。');");
E_D("replace into `sm_company` values('34','灾难不绝，难望成功，此数大凶，不如更名','凶','','破家亡身财命危险数。','（凶）','含义：属破坏的大凶兆。乱离的祸象颇强，凶煞一到，便接连而来，因而生大凶，大困难，大辛苦，内外破乱，万事龃龉。衰败，悲痛无限。因其他数的配置关系，有病弱短命，丧失配偶，子女离别，刑伤，杀伤，或致发狂，灾祸至极。为破家、亡身的最大凶数。');");
E_D("replace into `sm_company` values('35','中吉之数，进退保守，生意安稳，成就可期','(中吉)','诗云：温和平安艺才高，努力前途福运来，文笔奇绝仁德高，务实稳健掌门人。 \r\n幸运星：★★★★★☆☆','温和平静的优雅发展数。','（大吉）','含义：温良和顺之象。有智达的能力。在文艺、技术方面定能发展。若怀大志欲为大事者，须用最大的能力。彻底节义，以补不彻底的赋性和权威号召力。因其缺少胆略气魄，故此数实为保守平安的吉数，所以此最合女性，为男性则倾向消极。');");
E_D("replace into `sm_company` values('36','波澜重迭，常陷穷困，动不如静，有才无命','凶','','风浪不息的侠义薄运数。','（半凶半吉）','含义：为波澜重叠，浮沉万壮的英雄运。为侠气义情，敦厚舍己成仁之格。一生难得平安，辛苦困难甚多。袖手不动则不致大害，若愈活动即愈生泼澜，大变动，大衰，甚或酿成失败沦落。与其他运配合不善者，或病弱、短命、孤寡、厄难等无所不至。');");
E_D("replace into `sm_company` values('37','逢凶化吉，吉人天相，风条雨顺，生意兴隆','(中吉)+艺','诗云：权威显达得众望，忠实热诚运极旺，大德奏功无难事，终得富荣乐千锺。 \r\n幸运星：★★★★★☆☆','权威显达、吉人天相数。','（大吉）','含义；独立、单行、权威、忠实、奏功无比之象，和畅通达，热诚忠烈，得众信，破万难而成大业。慈祥有德，善发挥才能，享受天福之幸，终身福荣之极。但因权威独行，一面难免有孤独之憾，宜养雅量，留神平和。');");
E_D("replace into `sm_company` values('38','名虽可得，利则难获，艺界发展，可望成功','凶带吉','','磨铁成针刻意经营数。','（半凶半吉）','含义：非无大志，实乏统率的威望，缺乏首领的才干。屈于志而乏其力，不得众信，一种薄弱平凡之象。自然易陷于不幸失意而难以成功。但向文学、技艺方面发展，则有较强上进的能力。故此数艺术成功数。');");
E_D("replace into `sm_company` values('39','云开见月，虽有劳碌，光明坦途，指日可期','(大吉)+官','诗云：富贵荣华实可当，光明荣达好儿郎，家门隆昌福万千，世代子孙个个贤。 \r\n幸运星：★★★★★★☆\r\n因异性而引起之纠纷困扰，失利特多，而且一生常遇逆境之折磨。家庭和顺则万事可成。智能超人贯彻大志，富贵无比，不甘寂寞，叱吒风云之大吉数。切忌牢骚、贪心、欲望太多、永不知足影响前程。','富贵荣华的变化无穷数。','（半凶半吉）','含义：此数为祸乱一过，反成幸福贵重之格。权威、长寿、财帛丰富，德泽四方，财富盈身，富贵至极。暗藏悲惨凶象，所谓物极必反，切勿轻用之用。妇女若有此数者必陷孤寡。');");
E_D("replace into `sm_company` values('40','一胜一衰，浮沉不定，知难而退，自获天佑','吉带凶','','谨慎保安的豪胆迈进数。','（半凶半吉）','含义：富智谋，其胆力，含不逊之心。乏强望，易受诽谤攻击，处于浮沉吉凶的歧路上。好冒险投机。依其他运的关系，有酿刑伤犯罪者，有陷病弱，退之仅保稍安的运数。');");
E_D("replace into `sm_company` values('41','天赋吉运，德望兼备，继续努力，前途无限','(大吉)+财+官','诗云：德望高大名誉振，才谋健全财源进，富贵荣华福禄至，前途洋洋得意真。 \r\n幸运星：★★★★★★☆','德高望重的事事如意数。','（大吉）','含义：纯阳独秀的吉数。胆力才谋具备、健全、有德、和顺、能成大气大业，博得名利的最大好运数。');");
E_D("replace into `sm_company` values('42','事业不专，十九不成，专心进取，可望成功','吉带凶','','寒蝉在柳，十艺不成数。','（凶）','含义：博识多能，有技艺，精通世情，无奈十艺九不成，大都薄弱不如意，缺乏自信心。为寂寞悲苦之象，散漫失意之状。如果专心进取，或者可以成功，不然必大失败。此数中也有孤独病弱者。');");
E_D("replace into `sm_company` values('43','雨夜之花，外祥内苦，忍耐自重，转凶为吉','吉带凶','','邪途散财，外祥内苦数。','（半凶半吉）','含义：散财破产运，因循姑息，有如夜雨之花。薄弱散漫之象。虽有才智识，但意力不确实，诸事不能逐行。外观幸福，内多困苦。表面俨然成事，里面不堪设想。如果妇女有些数，理加上其他格的关系。易陷荒淫而不能善终。');");
E_D("replace into `sm_company` values('44','虽用心计，事难遂愿，贪功好进，必招失败','凶','','须眉难展力量有限数。','（凶）','含义：破家亡身的最恶数，暗藏惨之运，破坏，乱离之意，因此万事不能如意。逆境。烦闷、劳苦、病患、废疾、遭难、家属则生离死别。或因其他运的关系而发狂，短命。但乱世出怪杰，伟人、烈士、孝子、大发明家等，往往也出自此格数。');");
E_D("replace into `sm_company` values('45','杨柳遇春，绿叶发枝，冲破难关，一举成名','(中吉)+官','诗云：新生泰运顺行舟，排除万难总无忧，成功繁荣四海明，荣华富贵好前程。 \r\n幸运星：★★★★★☆☆','顺风扬帆、新生泰和的万事如意数。','（大吉）','含义：顺风扬帆之象。经纬深，智谋大，可遂大志大业。克服万难而成功，富贵繁荣至极。但若与其他运的凶数结合，即如浪中失舵之船，易遭灾难。');");
E_D("replace into `sm_company` values('46','坎坷不平，艰难重重，若无耐心，难望有成','凶','','罗网系身离祖成家数。','（半凶半吉）','含义：载宝沉舟之象。乏力，薄弱，悲哀困难辛苦，破坏失败者多。然而属于一类变怪的命运有大艰难尝尽后而又成功者或依其他运的关系，致到外陷孤独，刑罚，病患等灾祸。总之是难免于不幸的命运。');");
E_D("replace into `sm_company` values('47','有贵人助，可成大业，虽遇不幸，浮沉不大','(大吉)','诗云：开花结子衣食足，大业奏功可庆祝，子孙繁荣多快乐，一家圆满庆有馀。 \r\n幸运星：★★★★★★☆','点铁成金，开花结果的权威进取数。','（大吉）','含义：开花之象，祯祥吉庆之数。可享天赋的幸福，与朋友合作成大事大业，真是进可以攻，退可以守，可造福于子孙的吉运。');");
E_D("replace into `sm_company` values('48','美化丰实，鹤立鸡群，名利俱全，繁荣富贵','(大吉)+艺','诗云：有德且智德望高，堪为顾问得仁和，名利双收天赋富，威望荣达世间豪。 \r\n幸运星：★★★★★★☆','青松立鹤、德智兼备的出身清贵数。','（大吉）','含义：才能谋略齐备。有德量，含坚刚。为功利荣达的吉数。宜为人的顾问。威望洋洋，乃师数也。');");
E_D("replace into `sm_company` values('49','遇吉则吉，遇凶则凶，惟靠谨慎，逢凶化吉','凶','','吉凶难分的不断辛劳数','（凶）','含义：处吉凶的歧路。吉临则吉又生大吉，凶来则凶又变大凶，所以成败利得失极其浩大。有外大凶而他方面化吉者，其幸福与不幸福，专靠三才配合的好坏，以及其运的关联显现，但多陷于灾祸。');");
E_D("replace into `sm_company` values('50','吉凶互见，一成一败，凶中有吉，吉中有凶','吉带凶','','小舟人海，吉凶参半，须防倾覆数。','（半凶半吉）','含义：成败之象，先得\"五\"字的数理庇荫，而成大业，享受富贵，后由盈数（凡十谓之盈数）的暗示诱导而陷失败。甚至亡身破家于晚年，凄惨至极。若其他运又有凶数者，则是惨上加惨。杀伤、离悉、孤寡濒临。甚至于刑罚。');");
E_D("replace into `sm_company` values('51','一盛一衰，浮沉不常，自重自处，可保平安','吉带凶','','盛衰交加的竭力经营数。','（半凶半吉）','含义：一盛一衰之象，必然可得昌盛，博进一时名利，然后发现运中自然的凶兆。到晚年出挫折、困苦。遂至失败。');");
E_D("replace into `sm_company` values('52','草木逢春，雨过天晴，渡过难关，即获成功','(大吉)+财','诗云：先见机明察佳期，意志坚固好运时，功名利达福禄全，一世荣隆乐绵绵。 \r\n幸运星：★★★★★★☆','先见之明，理想实现数。','（吉）','含义：属于一跃将神之象。势能强大，无中生有的运数。有先见之明，计划不误，眼能察时世。富投机心，有谋略，他人之难不为难，实现大志大业而名利双收。是因为有眼光而成功的。');");
E_D("replace into `sm_company` values('53','盛衰参半，外祥内苦，先吉后凶，先凶后吉','吉带凶','','忧愁困苦，先苦后甜数。','（半凶半吉）','含义：外观俨然吉庆祯祥，内实障害祸患甚多。若非前半生不幸而后半生幸福，便是前半生富贵而后半生落魄。及盛衰参半的运数。一旦陷入凶煞，大多破家亡身，即命名得吉数他运相救，也仅保稍安而已。');");
E_D("replace into `sm_company` values('54','虽倾全力，难望成功，此数大凶，最好改名','凶','','多难悲运的难望成功数。','（凶）','含义：为大凶煞的暗示。悲惨不绝，不和、损伤、忧闷频来，遂致倾家荡产。或患废疾、刑罚、短命、孤独等。其中也有前半世幸福。');");
E_D("replace into `sm_company` values('55','外观隆昌，内隐祸患，克服难关，开出泰运','吉带凶','','外祥内苦的和顺不实数。','（凶）','含义：五数为最吉数，五上添五，乃是最吉生叠，反而生凶相了，故表面颇为隆昌，而内里则灾祸迭生，凡事不能安心，危难、别离、病患等无所不至，因而是吉凶相伴的运格。意志薄弱者，绝无立身之地。善能振雄威，坚心固志，打破万难，也可能有成功之日。');");
E_D("replace into `sm_company` values('56','事与愿违，终难成功，欲速不达，有始有终','凶','','浪里行舟、历尽艰辛，四周障害数。','（凶）','含义：缺乏实行的勇气，缺乏进取的气象，损失，灾厄，亡身等是所谓祸不单行者。万呈龃龉，精力不足，乃晚景最凶的运格。');");
E_D("replace into `sm_company` values('57','努力经营，时来运转，旷野枯草，春来花开','(中吉)','诗云：寒雪青松性刚强，一度祸难过灾殃，将此发达利亨通，晚景繁荣福无疆。 \r\n幸运星：★★★★★☆☆','寒雪青松的最大荣运数。','（吉）','含义：寒莺吟春之格，资性刚毅，获天赋之幸福而招致富贵。但一生必遭大难一次，然后得享吉祥，繁荣百事可以如意。');");
E_D("replace into `sm_company` values('58','半凶半吉，浮沉多端，始凶终吉，能保成功','凶带吉','','晚行遇月、先苦后甘，宽宏扬名数。','','含义：浮沉多端，祸福无常。所得福分，必经大失败大患难后方能显著。家破产亡后方得富贵繁荣。大都蔗尾生甜。晚年享受余庆。');");
E_D("replace into `sm_company` values('59','遇事犹疑，难望成事，大刀阔斧，始可有成','凶','','寒蝉悲风、时运不济数。','（凶）','含义：乏忍耐、缺勇气，意志衰退，无办事的能力，终于愁苦一生。');");
E_D("replace into `sm_company` values('60','黑暗无光，心迷意乱，出尔反尔，难定方针','凶','','争名夺利，黑暗无光数。','（凶）','含义：属晦冥黑、摆动不安的凶兆。方向不定尽任风波的运格。无谋不算而计划，岂能成功？难免失败苦恼或刑罚，杀伤，疾患，短命等。');");
E_D("replace into `sm_company` values('61','云遮半月，百隐风波，应自谨慎，始保平安','吉带凶','','名利双收的修炼积德数。','（吉）','含义：名利双收，繁荣富贵的吉兆。无奈傲慢不逊，致酿成内外不和，家庭反目，兄弟隔于墙。表面装饰堂煌，里面空虚。如果能修德慎行，且守和顺，自可防凶于未然。享天赋的幸福，一生受尽祯祥。');");
E_D("replace into `sm_company` values('62','烦闷懊恼，事事难展，自防灾祸，始免困境','凶','','基础虚弱的艰困苦数。','（凶）','含义：内外不和，缺乏信用，志望难达，渐入衰败之境。意外灾害频来，属身弱家废，步步凶惨之数。');");
E_D("replace into `sm_company` values('63','万物化育，繁荣之象，专心一意，始能成功','(大吉)','诗云：富贵荣达得显甯，子孙繁茂福绵绵，一身平安富益寿，福禄双全享千锺。 \r\n幸运星：★★★★★★☆','宝贵荣华的身心安泰数。','（大吉）','');");
E_D("replace into `sm_company` values('64','见异思迁，十九不成，徒劳无功，不如更名','凶','','骨肉分离，孤独悲愁数。','（凶）','含义：此数为破坏，别离、沉滞的凶兆。有意外灾害袭，或骨肉离散，或病患非命临身，人生难得安心。');");
E_D("replace into `sm_company` values('65','吉运自来，能享盛名，把握机会，必获成功','吉','','宝贵长寿的光明正大数。','（大吉）','含义天长地久，家庭隆昌。福寿绵长，事事成就，一生平安，多贵重的气运。');");
E_D("replace into `sm_company` values('66','黑夜漫长，进退维谷，内外不合，信用缺乏','凶','','内外不和的多欲失福数。','（凶）','含义：进退失自由，内外不和，艰难不堪，损害灾厄交至，大有身家破灭的凶相。');");
E_D("replace into `sm_company` values('67','时来运转，事事如意，功成名就，富贵自来','(大吉)','诗云：利路享通万事成，和畅逍达四海明，家运隆盛招富贵，万商云集得繁荣。 \r\n幸运星：★★★★★★☆','财路亨通的志气坚强数。','（吉）','含义：受长辈上级的援助，万事无障碍而达目的。乘天助的幸运，实现志望，家道繁昌，富贵东来的好运数。');");
E_D("replace into `sm_company` values('68','思虑周详，计划力行，不失先机，可望成功','(大吉)','诗云：兴家立业意志强，智虑周密名望扬，志操坚固信用重，一身才艺建基业。 \r\n幸运星：★★★★★★☆','兴家立业的宽容好运数。','（吉）','含义：智虑周密。志向坚定，勤勉力行，发展奋进之象。有发明的机能，集众信，愿望发达，名实两全的吉运数。');");
E_D("replace into `sm_company` values('69','动摇不安，常陷逆境，不得时运，难得利润','凶','','坐立不安的外世多难数。','（凶）','含义：穷迫、滞塞、逆境之象。缺乏坚定信心，灾害交至，摆动不安的凶运，致至陷于短命、伤残、或尝尽痛苦而死。');");
E_D("replace into `sm_company` values('70','惨淡经营，难免贫困，此数不吉，最好改名','凶','','家运衰退的晚景凄凉数。','（凶）','含义：险恶亡灭之象。一生惨淡，忧愁不绝，有空虚寂寞之感。难免杀伤，废疾，刑罚，离散等灾厄，不然便是世上无用之人。');");
E_D("replace into `sm_company` values('71','吉凶参半，惟赖勇气，贯彻力行，始可成功','吉带凶','','毫无实质的耗神耐劳数。','（半凶半吉）','含义：本有生成的吉兆，自应享受富贵福禄。无奈内心劳苦甚多，缺乏实行贯彻精神，进取的勇气不足，导致失败。故称吉凶参半的运数。');");
E_D("replace into `sm_company` values('72','利害混集，凶多吉少，得而复失，难以安顺','凶','','先甜后苦的万难艰辛数。','（凶）','含义：阴云蔽月之象，快乐贫穷兼而有之数。其前半生幸福，后半生悲惨，外观虽吉，内里生凶，甚有晚年家破人亡者。平素戒贪心，可免陷困苦。');");
E_D("replace into `sm_company` values('73','安乐自来，自然吉祥，力行不懈，终必成功','(中吉)','诗云：志高力微乏实行，妄谋无计事难成，晚年安宁静逸祥，享得天赋增吉相。 \r\n幸运星：★★★★★☆☆','志高力微的努力奋半数。','（半凶半吉）','含义：盛衰交加之象，无实行贯彻之勇，徒有高志而无成事之能。然而天生福气，大都终世平安。');");
E_D("replace into `sm_company` values('74','利不及费，坐食山空，如无智谋，难望成功','凶','','沉沦逆境的秋叶落寞数。','（凶）','含义：无能无智、仅取得衣食。真世上无有之辈。且易生意外之灾。辛苦繁多，沉沦逆境，哀叹命运。');");
E_D("replace into `sm_company` values('75','吉中带凶，欲速不达，进不如守，可保安详','吉带凶','','守者可安，发迹甚迟数。','（半凶半吉）','含义：虽有自然之吉相，无奈策划不成，若要做大事，便招失败。退守可保吉祥，进取必陷于失意的灾厄。');");
E_D("replace into `sm_company` values('76','此数大凶，破产之象，宜速改名，以避厄运','凶','','倾覆离散，虽劳无功数。','凶','');");
E_D("replace into `sm_company` values('77','先苦后甘，先甘后苦，如能守成，不致失败','吉带凶','','家庭有悦的半吉半凶数。','（半吉半凶）','含义：多获上级援护，幸福享至中年，然后陷落不平，悲叹灾厄，如果有悲运于前半生者，后半生却反得吉祥。');");
E_D("replace into `sm_company` values('78','有得有失，华而不实，须防劫财，始保平安','吉带凶','','晚境凄凉的功德光荣数。','（半凶半吉）','含义：祸福虽是参半，凶相较多一些，天生智能齐备，是以中年以前成功发达。及至中年后，渐自衰退，陷于困苦，大悲惨的暗示。');");
E_D("replace into `sm_company` values('79','如走夜路，前途无光，希望不大，劳而无功','凶','','挽回乏力的身疲力尽数。','（凶）','含义：穷迫不解的逆境，精精神不安，缺实行的能力。乏贞节，失信用，受攻击非难，为世所弃，成个废人，但身体却健康。');");
E_D("replace into `sm_company` values('80','得而复失，枉费心机，守成无贪，可保安稳','吉带凶','','凶星入度的清本缩小数。','（凶）','含义：一生困难辛苦不绝，病患，刑伤，夭折者多，但早入隐遁的生活者，可以安心立命，化凶转吉。');");
E_D("replace into `sm_company` values('81','最极之数，还本归元，能得繁业，发达成功','(大吉)','诗云：天地开泰万事成，身体康安亦富荣，否泰名誉兼享福，一生无忧乐绵长。 \r\n幸运星：★★★★★★☆\r\n顺风满帆而容易有所成就，易取富贵人生。','万物回春，还原始的积极盛大数。','（大吉）','含义：最极之数。还本归元。故其数理相等基数1。属于体力旺盛，庆幸万多，吉祥重叠。宝贵尊荣的大诱导之数。');");

require("../../inc/footer.php");
?>